{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[PAD]": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "\"\"": 94,
      "!!": 95,
      "-*": 96,
      "!$": 97,
      ")-*": 98,
      "\"#": 99,
      "\"$": 100,
      "\"&": 101,
      "!*": 102,
      "!$)-*": 103,
      "\"#\"\"": 104,
      "\"1": 105,
      "\"&\"\"": 106,
      "*\"\"": 107,
      "$!*": 108,
      "$)-*": 109,
      "!$)-*(": 110,
      "!!!!": 111,
      "\"#\"\"\"$": 112,
      "!(": 113,
      "\"1\"\"": 114,
      "!-": 115,
      "A*": 116,
      "&*": 117,
      ",$": 118,
      "\"#\"\"\"\"": 119,
      "!#": 120,
      "(!$)-*": 121,
      ".$": 122,
      "\"&\"\"\"\"": 123,
      "\"+": 124,
      "(*": 125,
      "*\"\"#": 126,
      "\"9": 127,
      ")!$": 128,
      "!!(": 129,
      "1*": 130,
      "\"&\"\"\"\"\"&": 131,
      "\"&\"\"\"$": 132,
      "\"#\"\"\"\"\"#": 133,
      "!&": 134,
      "+#": 135,
      "+\"$": 136,
      "!$!*": 137,
      "\"1\"\"\"\"": 138,
      "!!#": 139,
      "!!$)-*": 140,
      "!!-": 141,
      "/$)-*": 142,
      ")!": 143,
      "-)!$": 144,
      "/$)-*$)-*": 145,
      "$A*": 146,
      "!!($": 147,
      "2*": 148,
      "-!*": 149,
      "\"1\"\"\"\"\"1": 150,
      "\"\"\"\"": 151,
      "!!$!*": 152,
      "\"#\"\"$": 153,
      "+&": 154,
      "\"&\"$": 155,
      "\"\"#": 156,
      ",#": 157,
      "\"1\"\"\"$": 158,
      "!!!(": 159,
      "!$A*": 160,
      "4!": 161,
      "$!": 162,
      "-!": 163,
      "\"#+": 164,
      ".#": 165,
      "!$A*$A*": 166,
      "!!!": 167,
      "\"\"$": 168,
      "!!$)-*(": 169,
      "A*\"\"": 170,
      "\"&\"\"\"\"\"&*": 171,
      "\"&*": 172,
      "\"$)-*": 173,
      "$-*": 174,
      "!\"#\"\"\"$": 175,
      "2*\"\"": 176,
      "\"&+": 177,
      "9*": 178,
      "!$)-*(.$": 179,
      ")-": 180,
      "*(": 181,
      ")!4": 182,
      "&*\"\"#": 183,
      "!-\"#\"\"\"$": 184,
      "!$)-*-*": 185,
      "\"#\"\"\"\"$": 186,
      "(!$)-*,$": 187,
      ")(": 188,
      ",&": 189,
      "\"&\"\"$": 190,
      ".&": 191,
      "\"$%": 192,
      "\"#*": 193,
      "\"#\"\"\"\"\"#*": 194,
      "!1": 195,
      "!$)-*-": 196,
      "!\"#": 197,
      "\"9\"\"\"\"": 198,
      "!!!$": 199,
      "-)": 200,
      "\":": 201,
      "!!$": 202,
      ",$-*": 203,
      "(&": 204,
      "!!&*": 205,
      "!$!*$!*": 206,
      "\"1\"$": 207,
      ".$-*": 208,
      "!-*": 209,
      ".$!*": 210,
      "4!)!4": 211,
      "\"\"\"$": 212,
      "\"1\"\"\"\"\"1*": 213,
      ",$!*": 214,
      "+\"$%": 215,
      "!$)": 216,
      "\"1*": 217,
      "\"&\"#": 218,
      "(#": 219,
      "!!&": 220,
      "\"'": 221,
      "$)-*B": 222,
      "#*": 223,
      "E$)-*B": 224,
      "!/": 225,
      "++": 226,
      "!(#": 227,
      "-)!$(": 228,
      "1*\"\"": 229,
      "\"$!*": 230,
      "!D": 231,
      "\"9\"\"\"\"\"9": 232,
      "(*)-*": 233,
      "!$A*$A*A*": 234,
      "\"\"&": 235,
      "!!!!!!!!": 236,
      "\"0": 237,
      "!-!$)-*": 238,
      "\"#&": 239,
      "!!*": 240,
      "!$!*!*": 241,
      "-)!$-*": 242,
      "!\"#\"\"": 243,
      "!($": 244,
      ",1": 245,
      "&*\"#": 246,
      "!(!$)-*": 247,
      ".1": 248,
      "\"$-*": 249,
      "!!1*": 250,
      "!,$": 251,
      "$%": 252,
      "!$)-*(#": 253,
      "\"$(": 254,
      "4!$": 255,
      "\"1+": 256,
      "+\"$(": 257,
      "\"$-!*": 258,
      "!&*": 259,
      "!($!*": 260,
      "4(": 261,
      "/$)-*$)-*(": 262,
      "!$!*)-*": 263,
      "!+#": 264,
      "2*\"\"#": 265,
      "!-\"#\"\"$": 266,
      "-!$)-*": 267,
      "!)": 268,
      "\"&\"\"\"\"$": 269,
      "A*\"\"#": 270,
      "!!$!*!*": 271,
      "+1": 272,
      "\"#\"\"\"&\"$": 273,
      "\"#\"\"\"$%": 274,
      "\"7": 275,
      "$!*!*": 276,
      "\"#\"\"&": 277,
      "+\"&": 278,
      "!$)(*": 279,
      "\"9\"\"\"$": 280,
      "&*!!#": 281,
      "!!6": 282,
      "\"&\"+": 283,
      "-)!#": 284,
      "!!(#": 285,
      "\"$2*": 286,
      "!!-!$)-*": 287,
      "!#)-": 288,
      "!\"#\"\"\"\"\"#*": 289,
      "!\"#\"\"$": 290,
      ")!5": 291,
      "\"\"1": 292,
      "!!$!*$!*": 293,
      "(!$)-*.$": 294,
      "\"#\"+": 295,
      "\"1\"\"$": 296,
      "!(&": 297,
      "\"&\"\"\"$2*\"\"": 298,
      "+\"#": 299,
      "!\"#\"\"\"\"\"#": 300,
      "3*": 301,
      "F$)-*": 302,
      "9*\"\"": 303,
      "!.$": 304,
      "($": 305,
      ">2": 306,
      "\"\"&*": 307,
      "!$)-*(&": 308,
      "!$!*$!*!*": 309,
      "-*\"\"#": 310,
      "!1*": 311,
      "-!!": 312,
      "B*": 313,
      "!!$)-*-*": 314,
      "!$A*$A*A*\"\"": 315,
      "*(#": 316,
      "!\"#+": 317,
      "!$(*)-*": 318,
      "!,#": 319,
      "!!($!$)-*": 320,
      "E$)-*B*": 321,
      "\"&1*": 322,
      "\"#-": 323,
      "(!$)-*(": 324,
      ":*": 325,
      "-,$": 326,
      "!!!!!#": 327,
      "\"\"$%": 328,
      "+\"+": 329,
      "!$)-*(,$": 330,
      "\"#\"\"\"&\"$\"#*": 331,
      "+$": 332,
      "8&": 333,
      "1*\"\"#": 334,
      "\"#\"$": 335,
      "\"&\"\"\"$A*\"\"": 336,
      "!$)(*(*": 337,
      "$)-*)-*": 338,
      "-!-": 339,
      "\"#\"\"\"$2*\"\"#": 340,
      ")!$(*": 341,
      "!\"&\"\"\"\"\"&*": 342,
      "!D(*": 343,
      "!$-*": 344,
      "\"9\"\"": 345,
      "6#": 346,
      "!!#*": 347,
      "(D": 348,
      "!!!!(*": 349,
      "\"&*\"\"#": 350,
      "\"$)-*0": 351,
      "!.#": 352,
      "!!&*\"\"#": 353,
      "\"&+\"$": 354,
      "+&*": 355,
      "!!1": 356,
      "\"#+\"$": 357,
      "*\"\"&": 358,
      "!!!(#": 359,
      "'#": 360,
      "7#": 361,
      "!$A*$A*A": 362,
      "!!,$": 363,
      "(/$)-*$)-*": 364,
      "!&)-*": 365,
      "\"&\"\"\"$%": 366,
      "+&*\"\"#": 367,
      "8#": 368,
      "\"+#": 369,
      "\"&#": 370,
      "\"$A*": 371,
      "+$!*": 372,
      "!!!(!$)(*(*": 373,
      "\"\"1*": 374,
      "\"#\"\"\"\"&": 375,
      "\"&0": 376,
      "\"#)-": 377,
      "(1": 378,
      "!!!#": 379,
      "!!($!": 380,
      "!!(!$)-*": 381,
      "!$)/": 382,
      "\"9\"\"\"\"\"9*": 383,
      "\"#&*": 384,
      "+\"1": 385,
      "\"9*": 386,
      "F$)-*$-*": 387,
      "$!*!": 388,
      ")!$!*": 389,
      "$!!": 390,
      ".9": 391,
      "-.$": 392,
      "\"1\"\"\"\"$": 393,
      "!\"#\"\"\"\"$": 394,
      "$B*": 395,
      ">-)!$-*": 396,
      "3*\"\"": 397,
      "\"&\"\"\"1\"$": 398,
      "\"#%": 399,
      "\"&\"\"\"\"\"&*\"\"#": 400,
      "\"&\"\"\"\"\"&#": 401,
      ")(4": 402,
      "!9": 403,
      "\"$(*": 404,
      "!!+#": 405,
      "!!!$)-*-*": 406,
      "\"&\"\"1": 407,
      "!!$)-*-": 408,
      "!-\"#\"\"\"\"\"#": 409,
      ")!&": 410,
      "+$%": 411,
      "!-\"#\"\"\"\"$": 412,
      "!!!&": 413,
      ")!#": 414,
      "-!$!*)-*": 415,
      "+1*": 416,
      "!-\"#\"\"\"$%": 417,
      "\"#\"\"\"$A*\"\"#": 418,
      "\"1\"\"\"$2*\"\"": 419,
      "/$!*": 420,
      "\"&)-*": 421,
      "$!*!!": 422,
      ",9": 423,
      "*\"\"$": 424,
      "+#*": 425,
      "\"1\"\"\"$A*\"\"": 426,
      "\"9\"$": 427,
      "!$(*": 428,
      "\"1\"+": 429,
      "\"&\"\"\"$-*": 430,
      "!!/": 431,
      "\":\"\"\"\"": 432,
      "-!*\"$-!*": 433,
      "!!$-*": 434,
      ")!$5": 435,
      "(\"#+": 436,
      "\"#\"\"\"$-": 437,
      "\"&+#": 438,
      "/*": 439,
      "!!!$)-*(": 440,
      "\"&\"\"\"1\"$\"&*": 441,
      "!!!!#": 442,
      "!\"#\"\"\"$%": 443,
      "+\"\"": 444,
      ")(5": 445,
      "\"#\"\"\"$(": 446,
      "!*\"\"#": 447,
      "!!9*": 448,
      "!\"#\"+": 449,
      "!!!-": 450,
      "\"&\"\"\"$2*\"\"&*": 451,
      "\"#-!": 452,
      "!!(&": 453,
      "\"&\"\"\"+": 454,
      "1!!!!": 455,
      "!($!": 456,
      "6&": 457,
      "!D(": 458,
      "!\"#\"0": 459,
      "!!($!!*": 460,
      "\";": 461,
      "!$)/*(": 462,
      "4()!4": 463,
      "*\"\"&*": 464,
      "($!*": 465,
      "!-\"#\"\"&": 466,
      "!&*\"\"#": 467,
      "/$!*$)-*)-*": 468,
      "!&!!!!": 469,
      "-#": 470,
      "!,&": 471,
      "\"&+\"$%": 472,
      "!$)-*($": 473,
      "!+&": 474,
      "!!$(*)-*": 475,
      "!.&": 476,
      "-!$": 477,
      "\"#\"\"$%": 478,
      "2*\"$2*": 479,
      "!!$)-*(#": 480,
      "81": 481,
      "\"&\"\"$%": 482,
      "-*\"\"#*": 483,
      "+$!": 484,
      "-,$!-*": 485,
      "4!)!5": 486,
      "\"&\"\"\"\"\"#&*": 487,
      "1*\"\"&": 488,
      "!!$!": 489,
      "!#*": 490,
      "\"\"$!*": 491,
      ">-)!$-*!$A*$A*A": 492,
      ".#-": 493,
      "\"&*\"#": 494,
      "++#": 495,
      "!!!($": 496,
      "\"$!$)-*(": 497,
      "!!!(&": 498,
      "!)!": 499,
      "!,$-*": 500,
      ".$-*,$-*": 501,
      "\"&\"\"\"$A*\"\"&*": 502,
      "\"+&": 503,
      "\"$!*\"#": 504,
      "!$!*!": 505,
      "\"&+\"+": 506,
      "\"&\"\"\"\"\"#&": 507,
      "!!#$!*": 508,
      "!/$)-*$)-*": 509,
      "!-\"#\"\"": 510,
      "+\"$!*": 511,
      "+9": 512,
      "!$)-*-!": 513,
      "\"&\"\"#": 514,
      "!!!$(*)-*": 515,
      "\":\"\"\"\"\":": 516,
      "!$)-*(.$!!$!*!*": 517,
      "\"19*": 518,
      "!$)-*,$": 519,
      "\"1\"\"\"\"\"&1*": 520,
      "!!($!*": 521,
      "!.$-*": 522,
      ",#-": 523,
      "!!$)-*(.$": 524,
      "\"+\"#": 525,
      "\"&\"0": 526,
      "$(*": 527,
      "!\"&\"\"\"$": 528,
      "-*\"\"": 529,
      "\"&\"\"\"\"1": 530,
      "\"'#": 531,
      "+\"\"#": 532,
      "+7": 533,
      "-!!-": 534,
      "/$)-*$)-*(&": 535,
      "\"1\"\"\"$A*\"\"1*": 536,
      "D(*": 537,
      "()!$(*": 538,
      "!$)-*(.$!!!!(*": 539,
      "()!$": 540,
      "!!-!!&*": 541,
      "\"&'": 542,
      "!\"#\"\"$!*": 543,
      "\"9\"\"$": 544,
      ".$-": 545,
      "\"$-": 546,
      "\"#+\"$%": 547,
      "!!!,#": 548,
      "!$)-*-!*": 549,
      "\"10": 550,
      "2*\"#": 551,
      "\"$\"\"#": 552,
      "!!!!$)-*": 553,
      ">H": 554,
      "+\"&\"#": 555,
      "4!$)!5": 556,
      "\"\"\"+": 557,
      "-)/$)-*": 558,
      "!!,$!*": 559,
      "!($!$)-*": 560,
      "*\"\"\"#": 561,
      "!$)-*(.$!!!(!$)(*(*": 562,
      "3*\"\"#": 563,
      "\"1\"\"\"+": 564,
      "!$)-*(!": 565,
      "\"1\"\"\"$2*\"\"1*": 566,
      "(!$)-*!(!$)-*": 567,
      "\"&\"\"\"$!*": 568,
      "-)\"#": 569,
      "1*\"\"&*": 570,
      ".:": 571,
      "($!*!*": 572,
      "+\"$(*": 573,
      "\"&\"\"\"$-": 574,
      "1!!-": 575,
      "(!": 576,
      "!!.$": 577,
      "!!!!!": 578,
      "!#!!!!!#": 579,
      "$!*$": 580,
      "!\"#\"\"\"$-*\"\"#*": 581,
      "!!-\"#\"\"\"$": 582,
      "+0": 583,
      ".$!*-*": 584,
      "\"\"\"\"&": 585,
      "(!$)-*,$!!$!*!*": 586,
      "!!-!!#": 587,
      "\"&7": 588,
      "6#&": 589,
      "(!$)-*.#": 590,
      "1!*": 591,
      "!!-*": 592,
      "!$(*)-": 593,
      "!!6&": 594,
      "!\"#\"0\"&\"\"\"\"\"#&*": 595,
      "!!,&": 596,
      "!$)-*(.$!*": 597,
      "\"&\"\"\"$2*\"\"&": 598,
      ")!$(*(*": 599,
      "!\"#\"$": 600,
      "9$!*": 601,
      "4!)!": 602,
      "/!!$)-*(": 603,
      "!1)-*": 604,
      "!&)-": 605,
      "!$A*$A*A*\"\"#": 606,
      "4!$)!4": 607,
      "*\"\"1*": 608,
      "!)!$": 609,
      "$-": 610,
      "\"&*!!#": 611,
      "!(#!$)-*": 612,
      "!)!#": 613,
      "$!$A*$A*A*": 614,
      "!$)-*(.$!\"#\"\"\"\"\"#*": 615,
      "4!$)(5": 616,
      "!!&*\"#": 617,
      "\"\"\"1": 618,
      "\"1\"\"\"$%": 619,
      "\"\"\"\"#": 620,
      "2*\"$": 621,
      "\"\"&*\"\"#": 622,
      "!(#!!($": 623,
      "\"&+\"$(": 624,
      "\"&+\"1\"\"\"\"\"1": 625,
      "\"#\"\"\"\"$%": 626,
      "\"&\"\"$2*\"\"": 627,
      "!!!1": 628,
      "\"&\"$!*": 629,
      "!!!()!$(*(*": 630,
      "-!*\"#-!": 631,
      "=#": 632,
      "(!#": 633,
      "(!$)-*.$(*": 634,
      "\"\"9": 635,
      "61": 636,
      "!$)-*($!*": 637,
      "\"&\"\"\"\"$2*": 638,
      "\"&1*\"\"#": 639,
      "($!": 640,
      "\"&\"\"+": 641,
      "!&)(": 642,
      "!!9": 643,
      "E$)-*B*\"\"#": 644,
      "!&$": 645,
      "E$B*": 646,
      "!!!$!*": 647,
      "\"1\"\"9": 648,
      "!.1": 649,
      "\"&\"\"\"7": 650,
      "!!-!!-": 651,
      "2>": 652,
      "9*\"\"1*": 653,
      "!!!!&": 654,
      "4!)!$5": 655,
      "\"#'": 656,
      "!,1": 657,
      "!(1": 658,
      "$2*": 659,
      "4!)(4": 660,
      "(!$)-*,$!*": 661,
      "+#%": 662,
      "!&)-*\"\"#": 663,
      "\"&\"\"\"'": 664,
      "(!$)-*-": 665,
      "$A*$A*": 666,
      "-)/$)-*$": 667,
      "!/\"#+": 668,
      "(9": 669,
      "+&\"+": 670,
      "8&$!*": 671,
      "/$(*": 672,
      "\"1\"\"\"9\"$": 673,
      "!#$": 674,
      "\"&\"\"\"$-*\"\"&*": 675,
      "!\"&\"\"\"\"\"&": 676,
      "!#!!($": 677,
      "&*!#": 678,
      "-)E$B*": 679,
      "\"&+\"\"": 680,
      "\"&\"$\"#*": 681,
      "\"$(!$)-*": 682,
      "4!$!*": 683,
      "F$)-*$-*-": 684,
      "\"#\"\"\"$(!$)-*": 685,
      "\"&%": 686,
      "!!!!!&*": 687,
      "!#)": 688,
      "(#!!($": 689,
      "!#)!$": 690,
      "!$)(*(": 691,
      "\"#\"$!*": 692,
      "/$(*$)-*)-*": 693,
      "!!,#": 694,
      "+&*\"#": 695,
      "!!61": 696,
      "++&": 697,
      "\"1\"\"\"$-*": 698,
      "\"&\"\"\"$-!*": 699,
      "\"#\"\"\"$(&": 700,
      "\":\"\"\"$": 701,
      "\"\"$-*": 702,
      "!$)-*(#!!!,#": 703,
      "\"&\"$%": 704,
      "!!!(!$)-*": 705,
      "\"7#": 706,
      "!1!!!!": 707,
      "\"#!": 708,
      "!!!!!!!!!!!!": 709,
      "$!-*": 710,
      "(!$!*)-*": 711,
      "\"#\"0": 712,
      ",$-": 713,
      "\"$-!*\"#": 714,
      "\"&\"'": 715,
      "\"\"\"&": 716,
      "\"9\"+": 717,
      "!#)-*": 718,
      "\"$!$)-*-*": 719,
      "!!.#": 720,
      "\"+#*": 721,
      "\"&\"\"\"\"\"&*!!#": 722,
      "\"#+\"$(": 723,
      "\"1\"\"\"$!*": 724,
      "!.$!*": 725,
      ",&-*": 726,
      "!\"1\"\"\"\"\"1*": 727,
      "\"1\"&": 728,
      "4!)!&": 729,
      "E$)-*B*\"\"": 730,
      "!!!+#": 731,
      "+\"#&": 732,
      ")/*": 733,
      "-&*": 734,
      ":*\"\"": 735,
      "'&*": 736,
      ")(4(": 737,
      "\"#\"$-*": 738,
      "!!1*\"\"": 739,
      "(!#)-": 740,
      "$!$)-*(": 741,
      "!!/$)-*$)-*": 742,
      "\"#\"\"\"$3*\"\"#": 743,
      "!!\"#+": 744,
      "!$)-*.$": 745,
      "(!$)-*,$!!!!(*": 746,
      "\"&\"\"\"\"\"&\"#": 747,
      "1!!-!!1*": 748,
      "(!$)-*,$!!!(!$)(*(*": 749,
      "0#": 750,
      "\"&++\"$": 751,
      "\"&\"\"\"\"\"&*\"#": 752,
      "\"1\"\"\"9\"$\"1*": 753,
      "\"1\"\"+": 754,
      "!\"#\"\"&": 755,
      "!&!!&*": 756,
      "!$)-*-*\"\"#": 757,
      "%&": 758,
      "$!D(*": 759,
      "0\"$)-*": 760,
      "\"1\"\"\"$-": 761,
      "!#&": 762,
      "(!$)-*,$!-*": 763,
      "!9*": 764,
      "'#*": 765,
      "\"#\"\"\"+\"#": 766,
      "!!\"#\"\"\"$": 767,
      "!&)!$": 768,
      "(!$": 769,
      "!$)-*(1": 770,
      "A*\"$A*": 771,
      ".&-": 772,
      "!!!!-": 773,
      "\"1\"\"\"\"\"1*\"\"": 774,
      "!!,$!*,$": 775,
      "89": 776,
      ",:": 777,
      "!$)-*!$": 778,
      "!!!!(": 779,
      "-,$!-*.$-*,$-*": 780,
      "!!-!!": 781,
      "!!$!*!,$": 782,
      "\"&\"$)-*": 783,
      "!$)-*(!!": 784,
      "\"\"\"#": 785,
      "+&\"\"": 786,
      ";*": 787,
      "\"&\"\"\"1\"\"\"\"\"1": 788,
      "\"1*\"\"": 789,
      "!!$)-*(&": 790,
      "\"1\"\"\"7": 791,
      "(&!!($": 792,
      "!$)-*(.$!-*": 793,
      "E$!*": 794,
      "!)!$!*": 795,
      "\"#\"\"$2*\"\"": 796,
      "(!$)-*,$!": 797,
      "\"&\"\"\"$(": 798,
      "!$!*)-": 799,
      "\"1\"\"$2*\"\"": 800,
      "-&": 801,
      "$-*$": 802,
      "!$)-*4!)!4": 803,
      "\"1+\"+": 804,
      "!!!!$": 805,
      "\"&\"\"$!*": 806,
      "(!$)-*,$!\"#\"\"\"\"\"#*": 807,
      "+7#": 808,
      "4!#": 809,
      "!$)-*(!$": 810,
      "\"#\"\"\"$2*\"\"#*": 811,
      "-*\"$-*": 812,
      "/!": 813,
      "\"#\"\"+\"\"#": 814,
      "\"&\"\"$-*": 815,
      "\"1\"\"\"\"9": 816,
      "F$)-*$-*-*": 817,
      "!-\"#\"\"\"&\"$\"#*": 818,
      "\"$)-*+&": 819,
      "8#&": 820,
      "\"&*+#": 821,
      "\"9+": 822,
      "!$)-*($!": 823,
      "!&!!!!!&*": 824,
      "8#$!*": 825,
      "!\"#\"\"\"\"": 826,
      "\"17": 827,
      "\"&)-*\"\"#": 828,
      "-)!#(": 829,
      "\"&\"\"\"$A*\"\"&": 830,
      "!#!!#": 831,
      "(!$)-*!$": 832,
      "!$)-*(.$!!!$)-*-*": 833,
      "-!*\"$-!*\"$-!*": 834,
      "+\"\"&": 835,
      "\"#\"\"\"$E$)-*B*\"\"#": 836,
      "\"'1*": 837,
      "!\"#+\"$": 838,
      "\"#+\"\"": 839,
      "!!(#!$)-*": 840,
      "$!*$-*": 841,
      "-!*\"\"#": 842,
      "F$)-*$": 843,
      "(!$)-*-!": 844,
      "!!\"#\"\"\"\"\"#": 845,
      "\"#+\"&\"\"\"\"\"&": 846,
      "\"1&*": 847,
      "\"&\"$-*": 848,
      "\"&\"\"\"\"$A*": 849,
      "!(*": 850,
      "4()!$5": 851,
      "/#": 852,
      "\"#*(": 853,
      "\"\"\"\"1": 854,
      "!$!*$!*!": 855,
      "(\"#+\"$": 856,
      "\"$3*": 857,
      "$)-*)-": 858,
      "-)!$4!)!4": 859,
      ")!$4": 860,
      "\"1\"\"\"\"$2*": 861,
      "*\"\"\"#-": 862,
      "\"9\"\"\"$A*\"\"": 863,
      "\"$E$)-*B*": 864,
      "\"$%\"&\"\"\"\"\"&*": 865,
      ")!#5": 866,
      "!!$!*$!*-": 867,
      ")!!$)-*": 868,
      ">?": 869,
      "!!!!(#": 870,
      "4!)!$5!*": 871,
      "\"+&*": 872,
      "!!$!!$!": 873,
      "-!#": 874,
      "!!$)-*($": 875,
      "!!!!!#*": 876,
      "(.$": 877,
      "\"$2*\"#": 878,
      "\"&\"\"1\"$": 879,
      "\"1\"\"\"\"+1*": 880,
      "-!-1*": 881,
      "9*!!1*": 882,
      "\"1\"\"\"71*": 883,
      "6#$!*": 884,
      "\"&\"\"\"$(1": 885,
      "4!)!&5": 886,
      "8:": 887,
      "'&*\"\"#": 888,
      "8$!*$": 889,
      "\"&\"0\"1\"\"\"\"\"&1*": 890,
      "*\"\"$-!*\"#-!": 891,
      "\"#\"\"\"\"\"#*\"#\"\"\"\"\"#": 892,
      "!\"#\"\"\"$(!$)-*": 893,
      "\"&\"\"\"\"\"&%": 894,
      "\"#\"\"\"\"$2*\"#": 895,
      "!!!&$": 896,
      "-,#": 897,
      "!!,1": 898,
      "*(#!!($": 899,
      "!!!9": 900,
      "\"&\"\"\"+\"&*": 901,
      "!-\"#\"\"&\"$\"\"#": 902,
      "+&*!!#": 903,
      "@*": 904,
      "\"$)-*7": 905,
      "!!!!!!": 906,
      "!#)(": 907,
      "(\"#\"\"\"$": 908,
      "\"+\"&": 909,
      "!!!!!!!!!!!!!!!!": 910,
      "'1*": 911,
      "=&": 912,
      "!!61$!*": 913,
      "!&!!($": 914,
      "%\"#\"\"\"\"\"#": 915,
      "\"&\"\"\"7&*": 916,
      "\"9\"\"\"\"\"19*": 917,
      "\"#0": 918,
      "#!": 919,
      "!:": 920,
      "!\"#\"\"\"&\"$\"#*": 921,
      "\"#\"\"\"\"&\"\"\"\"": 922,
      "!$A*$A*A*\"#": 923,
      "!!!!&*": 924,
      "!!6#": 925,
      "!\"1\"\"\"\"\"1": 926,
      "\"&\"\"\"$3*\"\"": 927,
      "\"&\"\"\"$(!$)-*": 928,
      "\"&\"\"\"\"$!$A*$A*A*": 929,
      "!$)-*(.$!!$)-*-*": 930,
      "\"90": 931,
      "\"&\"\"\"\"\"&2*": 932,
      "!$)-*(.$!!!$(*)-*": 933,
      "!($!*!$)-*": 934,
      "(&!$)-*": 935,
      "($!$)-*": 936,
      "!1!!1*": 937,
      "\"#\"\"\"\"$A*": 938,
      "+#\"+": 939,
      "(!$)-*.#!!!(#": 940,
      "\"&\"\"\"'&*": 941,
      "\"9\"\"\"$2*\"\"": 942,
      "7&*\"\"#": 943,
      ".;": 944,
      "\"&\"\"\"\"+&*": 945,
      "\"1\"\"\"$-!*": 946,
      "!$)-*(!!$)-*(.$": 947,
      "$!!*": 948,
      "-!,#": 949,
      "!!($!*!*": 950,
      "-!-&": 951,
      "\"1++": 952,
      "!!(1": 953,
      "\"&!*": 954,
      "(!$)-*.&": 955,
      "6&$!*": 956,
      "!//": 957,
      "\"#\"\"\"'#": 958,
      "!!!$-*": 959,
      "!+#\"\"$": 960,
      "\"&\"\"$A*\"\"": 961,
      "\"#\"\"\"$A*\"\"#*": 962,
      "\"&\"\"\"$!$A*$A*A*\"\"": 963,
      "1*\"#": 964,
      "\"&\"\"\"\"$%": 965,
      "\"1\"$!*": 966,
      "/$)-*$)-*-*": 967,
      "\"&+7": 968,
      "+&\"$": 969,
      "!!!,$": 970,
      "!)-*": 971,
      "!\"#\"\"\"$-": 972,
      "!+#\"$)-*": 973,
      "!!#)!$": 974,
      "!$)-*(,#": 975,
      "(!$)-*,$!!$)-*-*": 976,
      "\"#\"\"\"&0": 977,
      "\"$)-*0\"#)-": 978,
      "\"1\"\"\"+\"1*": 979,
      "(!!": 980,
      ".$-!$)-*": 981,
      "!$)-*(.$!!$(*)-*": 982,
      "-.1": 983,
      "+\"&#": 984,
      ".$(*": 985,
      "+\"9": 986,
      "\"#\"'": 987,
      "\"1+\"$": 988,
      "\"$!D(*": 989,
      "'\"#": 990,
      "!&*\"#": 991,
      "\"$A*\"#": 992,
      "\"&\"\"\"$/$)-*$)-*(": 993,
      "\"1\"\"\"$2*\"\"1": 994,
      "-\"#\"\"\"$": 995,
      "9*\"\"1": 996,
      "(!$)-*,$!!!$)-*-*": 997,
      "\"#\"\"\"7#": 998,
      ".$!-*": 999,
      "!\"#\"\"\"$2*\"\"#": 1000,
      "-.&": 1001,
      "$!$)-*-*": 1002,
      "!!.&": 1003,
      ",$-*,$-*": 1004,
      "(!$)-*,$!!!$(*)-*": 1005,
      "\"1'": 1006,
      "!!-!!9*": 1007,
      "!!8&": 1008,
      "\"'#*": 1009,
      "!6#&": 1010,
      "\"+1*": 1011,
      "\"#\"\"\"\"+#": 1012,
      ".$!*!!*": 1013,
      "!-\"#\"\"$%": 1014,
      "!$)-*\"#\"\"\"\"\"#": 1015,
      "\"&\"\"\"\"\"&+#": 1016,
      "\"1)-*": 1017,
      "\"#+\"+&": 1018,
      "\":\"$": 1019,
      "!!.9": 1020,
      "-,&": 1021,
      "!+#\"+": 1022,
      "\"&\"\"\"\"\"&A*": 1023,
      "!\"#\"\"$%": 1024,
      "!!-!$)-*!#": 1025,
      "\"$)-*+#": 1026,
      "+9*": 1027,
      "\"#++\"$": 1028,
      "\"\"$-!*": 1029,
      "(!$)/*(": 1030,
      "!!!$)-*": 1031,
      "81$!*": 1032,
      "!-\"#\"\"\"$(!$)-*": 1033,
      "-.#": 1034,
      "!!#$": 1035,
      "!!69": 1036,
      "\"1+\"\"": 1037,
      "!6": 1038,
      "\"1\"\"+\"\"1*": 1039,
      "!$\"&\"\"\"\"\"&*": 1040,
      "\"&\"\"\"\"1\"\"\"\"": 1041,
      "!!!!#*": 1042,
      "\"&\"\"\"$E$)-*B": 1043,
      "!-\"#\"\"$-!*": 1044,
      "\"1\"\"\"'1*": 1045,
      "\"1\"\"9\"$": 1046,
      "\"&+++": 1047,
      "!\"#+7": 1048,
      ")E": 1049,
      "\"&\"\"\"$!$)-*(": 1050,
      "\"&\"\"\"\"$2*\"&*": 1051,
      "-,$!-": 1052,
      "\"$(1": 1053,
      ">H>H": 1054,
      "\"&\"\"+\"\"&*": 1055,
      "\"#\"\"\"\"\"#%": 1056,
      "\"#\"\"\"\"&\"#": 1057,
      "\"&\"\"\"\"\"&*+#": 1058,
      "!!.1": 1059,
      "$!1": 1060,
      "7&*": 1061,
      "!!$!*)": 1062,
      "\":\"\"\"\"\":*": 1063,
      "'\"&\"#": 1064,
      "\"$!$)-*": 1065,
      "!!(#!!($": 1066,
      "!$)/*": 1067,
      "4!)!4!$)-*": 1068,
      "\"&+\"1\"$": 1069,
      "\"$)-*+$!*": 1070,
      "!$)-*(\"#\"\"\"$": 1071,
      "\"#\"$%": 1072,
      "2*\"\"&": 1073,
      "$!D": 1074,
      "\":*": 1075,
      "()!$(*(": 1076,
      "(!$)-*!(!$)-*,$": 1077,
      "\"#)-*": 1078,
      "4!$)(4": 1079,
      "(*+\"+": 1080,
      "\"&\"\"\"1\"$\"&*-!-1*": 1081,
      ",$-!$!*)-*": 1082,
      "-,$!-*.$-*": 1083,
      "!!69$!*": 1084,
      "\"#\"\"\"\"\"#*(": 1085,
      "\"$-*\"#": 1086,
      ",$-*.$-*": 1087,
      "$)-*7": 1088,
      "\"&\"$A*\"\"": 1089,
      "!(&!!($": 1090,
      "\"&\"\"$(!$)-*": 1091,
      "\"#\"\"\"$-*\"\"#": 1092,
      "4!)(4(": 1093,
      "!!!($!": 1094,
      "\"1\"\"\"\"\"1&*": 1095,
      "\"&+\"\"\"\"&": 1096,
      ".$!-": 1097,
      "!!!!*": 1098,
      "\"$(&": 1099,
      "!!-!!#*": 1100,
      "!!-!!&*\"\"#": 1101,
      "*\"\"1": 1102,
      "\"&\"$2*\"\"": 1103,
      "\"&\"1\"$": 1104,
      ">I": 1105,
      "!!$A*$A*": 1106,
      "\"<": 1107,
      "\"1\"\"$%": 1108,
      "!\"#\"\"\"$A*\"\"#": 1109,
      "\":\"\"": 1110,
      "\"$/": 1111,
      "1*\"\"&*\"\"#": 1112,
      "(!$)-*-!$!*$!*!*": 1113,
      "\"&+\"$!*": 1114,
      ".$-!$!*)-*": 1115,
      "\"&\"\"\"$%\"1\"\"\"\"\"1": 1116,
      "!!!($!$)-*": 1117,
      "\"&\"#*": 1118,
      "*\"\"#*": 1119,
      "/$)-*$)-*(#": 1120,
      "\"&\"\"#-!": 1121,
      "\"&\"\"1\"\"\"\"": 1122,
      "!,$(*": 1123,
      "$!*\"#": 1124,
      "\"&++\"$%": 1125,
      "!4!)!5": 1126,
      "\"#\"\"$!*": 1127,
      "\"\"$!$)-*(": 1128,
      "\"$!$A*$A*A*": 1129,
      "(!$)-*,$!!$(*)-*": 1130,
      "!*\"\"": 1131,
      "\"1*\"\"&": 1132,
      "!!!!,$": 1133,
      "=$": 1134,
      "\"#\"\"\"+": 1135,
      "\"1\"\"\"$3*\"\"": 1136,
      "4!$!*)!4": 1137,
      "!!D": 1138,
      "!(#!!!$": 1139,
      "\"1\"\"\"$!$A*$A*A*\"\"": 1140,
      "!!($!*!!": 1141,
      "/*(": 1142,
      "A*\"\"&": 1143,
      "!+#\"\"": 1144,
      "-!1": 1145,
      ")!$!*!*": 1146,
      "-1*": 1147,
      "!\"#\"\"\"\"$%": 1148,
      "\"#\"\"\"$!$)-*(": 1149,
      "!!!.#": 1150,
      "$\"&\"\"\"\"\"&*": 1151,
      "(#!$)-*": 1152,
      "\"&A*": 1153,
      "\"1+\"9\"\"\"\"\"9": 1154,
      "!$!$)-*(": 1155,
      "\"1\"\"\"\"\"&1*\"\"#": 1156,
      "!1*\"\"": 1157,
      "\"1\"\"$-*": 1158,
      "\"\"\"9": 1159,
      "!-\"#\"\"\"\"$%": 1160,
      "+1\"+": 1161,
      "\"1\"\"\"\"\"1&*\"\"#": 1162,
      "!$)-*(.$!\"#\"0\"&\"\"\"\"\"#&*": 1163,
      "!(9": 1164,
      "!!(*": 1165,
      "!!$!*-": 1166,
      "!!$!*,$": 1167,
      "\"0#*": 1168,
      "\"\"&#": 1169,
      "\"1\"\"$!*": 1170,
      "+&%": 1171,
      "\"1\"&*": 1172,
      "-!-9*": 1173,
      "1!!!!!1*": 1174,
      ",$-!$)-*": 1175,
      "-!&": 1176,
      "!(/$)-*$)-*": 1177,
      "!!&*!!#": 1178,
      "!$)-*(#!!($": 1179,
      "!$)-*(#!!!$": 1180,
      ">2>2": 1181,
      "!!!!(!$)-*": 1182,
      "!$A*A*": 1183,
      "!\"#\"\"\"$!$)-*(": 1184,
      "\"#\"\"\"$2*\"$2*": 1185,
      "+&\"+\"1\"$": 1186,
      "\"9\"\"\"\"\"91*": 1187,
      ",1-*": 1188,
      "!-\"#\"\"\"&\"$": 1189,
      "\"1\"\"\"\"$A*": 1190,
      "!!&$": 1191,
      "$!!!*": 1192,
      "-!$!*$!*": 1193,
      "(!$)-*!/": 1194,
      "!-\"#\"\"\"$!&": 1195,
      "\"\"#*": 1196,
      "\"1\"\"\"$A*\"\"1": 1197,
      "+&+\"$": 1198,
      "!!!!9*": 1199,
      ",;": 1200,
      "\"#\"\"&\"\"\"\"": 1201,
      "-!!$-*": 1202,
      "!!1*\"\"&": 1203,
      "!!!1*": 1204,
      "\"$)-*+$": 1205,
      "!\"#\"\"\"$/$)-*$)-*(": 1206,
      "\"&\"\"\"$2*\"$2*": 1207,
      "\"1\"0": 1208,
      ">X": 1209,
      "-!*\"#": 1210,
      "!,$!*": 1211,
      "(*\"\"": 1212,
      "!$)-*-!$!*$!*!*": 1213,
      "\"&\"\"1\"$\"\"&": 1214,
      "++&*": 1215,
      "\"$%\"1\"\"\"\"\"1*": 1216,
      "!D!": 1217,
      "\"&\"\"$-": 1218,
      "!!$)-*(\"#\"\"\"$": 1219,
      ".$!*-": 1220,
      "\"1!*": 1221,
      "!$)-*(.$!!!()!$(*(*": 1222,
      "1!!!!1*": 1223,
      "\"7#*": 1224,
      "!4!$)(5": 1225,
      "!$)-*(.$!": 1226,
      "\"&\"\"$!$)-*(": 1227,
      "\"#\"\"\"$!$A*$A*A*\"\"#": 1228,
      "!\"#\"\"\"$(": 1229,
      "(!$)-*!#": 1230,
      "+&\"\"$": 1231,
      "A!$A*$A*": 1232,
      "\"&2*": 1233,
      "0\"$": 1234,
      "\"&+\"\"$": 1235,
      "]$B*": 1236,
      ")!1": 1237,
      "!!!(1": 1238,
      "!!)": 1239,
      "!-\"#\"\"&\"$\"\"#-!*": 1240,
      "\"1\"\"\"$!$)-*(": 1241,
      "+#&": 1242,
      "!!!$)-*-": 1243,
      "+\"&+#": 1244,
      ".#!": 1245,
      "!!!!$!*": 1246,
      "\"#\"\"\"$-!": 1247,
      "\"#\"\"\"$!*\"\"#": 1248,
      "!\"#7": 1249,
      "!!.$!*": 1250,
      "\"#\"\"&\"$\"\"#": 1251,
      "1*!!#": 1252,
      "\"1\"\"9\"$\"\"1": 1253,
      ".#&": 1254,
      "+1\"\"": 1255,
      "(&!!-!!&*": 1256,
      "\"&0#": 1257,
      "\"1+\"$%": 1258,
      "!-,#": 1259,
      "\"$!": 1260,
      "!\"#\"\"\"\"\"#*(": 1261,
      "!&)": 1262,
      "!4!$)!5": 1263,
      "!(&!$)-*": 1264,
      "\"1\"\"\"$!*\"\"1*": 1265,
      "\"&\"\"\"$!*\"\"&*": 1266,
      "+\"&*": 1267,
      "\"1\"\"\"$-*\"\"1*": 1268,
      "!$A*$A*A*\"\"$!$A*$A*A*": 1269,
      "!-\"#\"\"\"$-!*": 1270,
      "3*\"\"&": 1271,
      "+\"#%": 1272,
      "+\"&%": 1273,
      ",$!*.$-": 1274,
      "!!(9": 1275,
      "-!,#-.$": 1276,
      "!\"#\"+\"0#*": 1277,
      "!\"#\"0\"+#*": 1278,
      "!!\"&\"$": 1279,
      "!!6&$!*": 1280,
      "\"#\"+$": 1281,
      "\"1\"\"\"\"$2*\"1*": 1282,
      "!,$(!$)-*": 1283,
      "!!!(*": 1284,
      "\"1&*\"\"#": 1285,
      "+\"\"1": 1286,
      "!,#!($": 1287,
      "!!-!!1*": 1288,
      "8&$": 1289,
      "!!!&$!!#*": 1290,
      "\"&\"\"\"$3*\"\"&*": 1291,
      "-!*\"\"": 1292,
      "!!!(#!$)-*": 1293,
      "!1!!!!!1*": 1294,
      "\"1\"\"\"$(9": 1295,
      "!!8&$!*": 1296,
      "++1*": 1297,
      "4!)!4!": 1298,
      "\"&!#": 1299,
      "!!-\"#\"\"$": 1300,
      "!/*": 1301,
      "\";\"\"\"\"": 1302,
      ">-)!$-*!$)-*-": 1303,
      "(!$)-*!": 1304,
      "\"9\"\"\"+": 1305,
      "-*\"$": 1306,
      "\"1\"\"\"\"\"1*!!&*": 1307,
      "!!-\"#\"\"\"\"\"#": 1308,
      "\"&\"\"\"$2*\"\"&2*": 1309,
      "\"#+\"+": 1310,
      "!!!*": 1311,
      "7\"&\"#": 1312,
      "!$)-*(.$!\"#\"\"\"$-*\"\"#*": 1313,
      ",$!-*": 1314,
      "71*": 1315,
      "4!)!4!$)-*(": 1316,
      "\"#+\"&\"$": 1317,
      "!-.#": 1318,
      "!-\"#\"\"\"$(": 1319,
      "*\"\"#&": 1320,
      "\"&\"\"$/$)-*$)-*(": 1321,
      "\"\"#&": 1322,
      "!!!/": 1323,
      "!-\"#\"\"\"$!$)-*(": 1324,
      "(\"#+\"+": 1325,
      "\"#\"\"\"\"$A*\"#": 1326,
      "3>": 1327,
      "+&!*": 1328,
      ",$-*.#-": 1329,
      "(\"#\"\"\"\"\"#": 1330,
      "\"&\"\"\"1\"\"\"\"\"1\"&*": 1331,
      "\"1\"\"\"9\"\"\"\"\"9": 1332,
      "!)!&": 1333,
      "\"&+\"$(*": 1334,
      "!!\"#\"\"$": 1335,
      "!!$(*": 1336,
      "!$)-*!#": 1337,
      "!!!!1": 1338,
      "!/$)-*$)-*(": 1339,
      "!$(": 1340,
      "4!)(4(!$)-*": 1341,
      "\"1\"\"$A*\"\"": 1342,
      "!$(*)(": 1343,
      "8$-*$": 1344,
      ",#!!,&": 1345,
      "!#!!!!!#*": 1346,
      "\"#\"\"&\"$": 1347,
      "6#$": 1348,
      "!!!!!1*": 1349,
      "+#\"\"": 1350,
      "!!&*+#": 1351,
      "\"&\"\"\"\"\"&*\"\"#*": 1352,
      "7+#": 1353,
      "($!*!$)-*": 1354,
      "\"\"$!*\"$)-*0": 1355,
      "\"#\"\"\"$%\"&+": 1356,
      "E$)-*B*\"#": 1357,
      "!\"#\"+$": 1358,
      "!(&!!!$": 1359,
      "+\"$-*": 1360,
      "(#!!!$": 1361,
      "&*\"\"#*": 1362,
      "(!$)-*\"#\"\"\"$": 1363,
      "\"#\"$2*\"\"": 1364,
      "*($": 1365,
      "6$!*$": 1366,
      "$A*\"$": 1367,
      "!\"#\"'": 1368,
      "\"1\"\"&": 1369,
      "!!.98:": 1370,
      "!&1": 1371,
      "++1": 1372,
      "+\"1*": 1373,
      "\"+1": 1374,
      "69": 1375,
      "+\"&\"$": 1376,
      "\"#\"\"\"\"$-": 1377,
      "!-!$)-*!#": 1378,
      "/!*": 1379,
      "\"&\"\"\"\"1\"\"\"\"\"&1*": 1380,
      "!!$)-*-,#": 1381,
      "(!$)-*\"#\"\"\"\"\"#": 1382,
      "89$!*": 1383,
      "!!:*": 1384,
      "\"%&": 1385,
      "*\"\"$%": 1386,
      "!$!*!*\"\"#": 1387,
      "!$)-*(!!$)-*(": 1388,
      "!&*!#": 1389,
      "!!!!1*": 1390,
      "\"\"&*\"#": 1391,
      "\"#\"\"\"\"$(": 1392,
      "8&1": 1393,
      "\"1\"\"\"\"\"12*": 1394,
      "!!!!$)-*(": 1395,
      ",$(*": 1396,
      "!!/!*": 1397,
      "!(!": 1398,
      "(!$)-*,$!\"#\"\"\"$-*\"\"#*": 1399,
      "\"9\"\"\"$A*\"\"9*": 1400,
      "-)!$(\"#\"\"\"$": 1401,
      "!D(*\"\"#": 1402,
      "!!691!*": 1403,
      "\"$%\"1\"\"\"$": 1404,
      "\"&\"\"\"$!$)-*-*": 1405,
      "+\"\"$": 1406,
      "!!,9": 1407,
      "\"9\"\"\"\"$": 1408,
      "\"$)-*\"$!$)-*-*": 1409,
      "!$)-*-!!*": 1410,
      "!=#": 1411,
      "+#\"\"$": 1412,
      "!!+#\"$": 1413,
      "!!!!!&*\"\"#": 1414,
      "\"1\"$A*\"\"": 1415,
      "!!\"#\"\"\"\"\"#*": 1416,
      "\"&-*": 1417,
      "!+#\"$": 1418,
      "!\"#\"\"$(": 1419,
      "!-!#": 1420,
      "\"&\"\"\"$-!": 1421,
      "!!$!*(": 1422,
      "!\"#\"\"\"$!*": 1423,
      ",$!\"#\"\"\"\"\"#*": 1424,
      "\"&\"\"\"$-!*\"\"&*": 1425,
      ".$!": 1426,
      "-)\"#0": 1427,
      "+\"&\"\"\"\"\"#&": 1428,
      "!!!!!&": 1429,
      ".&-*": 1430,
      "\"&*!#": 1431,
      "!D(*\"\"": 1432,
      "\"#7": 1433,
      "\"#\"\"\"\"&\"\"\"\"\"#&": 1434,
      "\"&\"\"\"$2*": 1435,
      "!\"#+\"$%": 1436,
      "\"&\"\"\"1+": 1437,
      "\"#1*": 1438,
      "$!!$)-*(": 1439,
      "1*!#*": 1440,
      "\"#-*": 1441,
      "!!)!": 1442,
      "\"#\"\"\"&\"\"\"\"\"&\"#": 1443,
      "!!!,&": 1444,
      "\"1\"\"\"\"\"1*\"\"&": 1445,
      "!$)-*(&!!($": 1446,
      "!-\"#\"\"\"$2*\"\"#": 1447,
      "\"#(": 1448,
      "0&*": 1449,
      "8#$-*": 1450,
      "!!!$!*$!*": 1451,
      "(!$)-*!-": 1452,
      "\"9:*": 1453,
      "!$!*$!*.:": 1454,
      "\"#\"\"$A*\"\"": 1455,
      "!!&*!#": 1456,
      "\"&\"\"$-!*\"$-!*\"$-!*": 1457,
      "\"#\"\"\"\"\"#-": 1458,
      "\"19*\"\"": 1459,
      "\"&\"\"\"$A*": 1460,
      "!!6#&": 1461,
      "()!#": 1462,
      "!!\"&\"\"\"\"\"&": 1463,
      "!\"#\"\"\"$/$)-*$)-*": 1464,
      "\"1\"\"\"\"\"1A*": 1465,
      "!9)-*": 1466,
      ")(*": 1467,
      "\"#+\"\"$": 1468,
      "!$)-*!": 1469,
      "!/!!,$": 1470,
      "\"1\"\"\"\"$!$A*$A*A*": 1471,
      "\"&\"\"+\"\"": 1472,
      "\"#\"\"\"\"\"#2": 1473,
      "\"&\"\"\"$2*\"\"&*\"\"#": 1474,
      "\"#\"\"\"$-!*\"\"#": 1475,
      "(!$)-*.&!!!(&": 1476,
      "++$%": 1477,
      "\"1\"\"\"9\"$\"1*-!-9*": 1478,
      "4\"$": 1479,
      "!$!D(*": 1480,
      "!!$!*$": 1481,
      "-!!$)-*(": 1482,
      "F$)-*$-": 1483,
      "-)/$)-*$(": 1484,
      "8#$": 1485,
      "\"\"\"$(*": 1486,
      "/&": 1487,
      "7#*": 1488,
      "(!$)-*,$!\"&\"\"\"\"\"&*": 1489,
      "\"#\"\"\"\"$-*": 1490,
      "\"&\"\"'": 1491,
      "!$2*": 1492,
      ",&-": 1493,
      "F$)-*$B*": 1494,
      "*(&": 1495,
      "E$!*$!*": 1496,
      ")!$-*": 1497,
      "--": 1498,
      "!!!$)-*(#": 1499,
      "\"#\"\"$-*": 1500,
      "!!$(!$)-*": 1501,
      "\"#\"\"\"+\"#*": 1502,
      "\"$)-*+1": 1503,
      "!($!*!*": 1504,
      "\"&\"\"\"\"$-*": 1505,
      "+1*\"\"": 1506,
      "!!#&": 1507,
      "!!($!!": 1508,
      "0\"&\"#": 1509,
      "!#!!!!#": 1510,
      "\"#\"$A*\"\"": 1511,
      "\"+\"&\"#+\"+&": 1512,
      "\"#\"\"\"\"$(!$)-*": 1513,
      "!!!!($": 1514,
      "!-!$)-*(": 1515,
      "\"#++\"$%": 1516,
      "%1": 1517,
      "++&*\"\"#": 1518,
      "\"&\"\"\"10": 1519,
      "\"#\"\"$(": 1520,
      "!(!$)-*(": 1521,
      "4!)!4!$)-*-": 1522,
      "-)!$!/\"#+": 1523,
      "\"&\"\"\"$E$)-*B*\"\"&*": 1524,
      "!!(/$)-*$)-*": 1525,
      "&*+#": 1526,
      "\"#\"\"\"\"\"#&": 1527,
      "(!$)-*-!\"#\"\"\"\"\"#*": 1528,
      "\"91*": 1529,
      "!!!!!9*": 1530,
      "-!!!!": 1531,
      "!-\"#\"\"\"$/$)-*$)-*(": 1532,
      ",&!": 1533,
      "+9\"+": 1534,
      "!!)!$": 1535,
      "\"#\"&\"$": 1536,
      "!!!.$": 1537,
      "!!!1$": 1538,
      "-)!$(!#": 1539,
      ",#!!,$": 1540,
      "\"1\"\"\"$-!*\"\"1*": 1541,
      "\"1\"$%": 1542,
      "\"&\"\"\"\"$!$A*$A*A*\"&*": 1543,
      "!!69$!*,1": 1544,
      "\"9)-*": 1545,
      "!\"#\"$%": 1546,
      "\"&\"\"\"$A*\"\"&*!!#": 1547,
      "\"&\"\"\"\"$A*\"&*": 1548,
      "\"#\"\"\"$%\"&\"+": 1549,
      "\"$/$)-*$)-*(": 1550,
      "!\"#\"\"\"\"&": 1551,
      "\"\"&\"#": 1552,
      "\"#\"\"\"\"+#*": 1553,
      "!!\"&\"\"\"\"\"&*": 1554,
      "\"1\"\"\"+\"1": 1555,
      "\"$)-*0#": 1556,
      "!!#!!!!!#*": 1557,
      "\"&\"\"\"\"$E$)-*B*": 1558,
      "\"&\"\"$)-*": 1559,
      "!$!*!*!$!*!*": 1560,
      "/$!*$)-*)-": 1561,
      "+\"$(1": 1562,
      "$!\"&\"\"\"\"\"&*": 1563,
      "!!,$-*": 1564,
      "\"#+\"$!*": 1565,
      "!-!!-": 1566,
      "!!!-*": 1567,
      "=$B*": 1568,
      "\":\"\"$": 1569,
      "\"9\"\"\"$2*\"\"9*": 1570,
      "4()(4": 1571,
      "\"9\"\"\"\"\"9*\"\"1*": 1572,
      "!\"&\"\"\"\"\"&*!!#": 1573,
      "\"&\"\"\"$2*\"\"&*!!#": 1574,
      "!$)-*\"&\"\"\"\"\"&": 1575,
      "!4!)!4": 1576,
      "!$-*!$-*": 1577,
      "!-!$": 1578,
      "(!$)-*,$!\"#\"0\"&\"\"\"\"\"#&*": 1579,
      "-\"&\"\"\"$": 1580,
      "(D!\"#\"\"\"$": 1581,
      "!-\"#\"$": 1582,
      "9*!&*": 1583,
      "!#-": 1584,
      "!!1!!$!!$!": 1585,
      "6$!*$-*": 1586,
      "0#*": 1587,
      "+\"&\"\"\"\"\"&#": 1588,
      "\"&\"\"\"\"$!*": 1589,
      "/$)-*$)-*B*": 1590,
      "\"&\"\"$(": 1591,
      "!1*\"\"#": 1592,
      "\"1\"\"\"$3*\"\"1*": 1593,
      "!!+#\"\"$": 1594,
      "!!$)-*-!": 1595,
      "\"\"\"$%": 1596,
      "\"&\"\"$2*\"\"\"&": 1597,
      "\"&\"\"\"$A*\"\"&*\"\"#": 1598,
      "%\"#\"\"\"$": 1599,
      ",$!*!-*": 1600,
      "-!,1": 1601,
      "!!$(": 1602,
      "!-\"#\"\"\"$!$)-*": 1603,
      "\"1\"\"\"$(": 1604,
      "(&!!!$": 1605,
      "!$)-*-*\"\"": 1606,
      "!!1!!$!!$!1*!#*": 1607,
      "!!!!+#": 1608,
      "!-\"#\"\"\"\"&": 1609,
      "!($!*/$)-*$)-*": 1610,
      "!+#\"\"$%": 1611,
      "!!&!!&*": 1612,
      "!!$!$)-*(": 1613,
      "\"&\"$A*\"\"\"\"&": 1614,
      "\";\"\"\"\"\";": 1615,
      "!-!$)-*\"#\"\"\"$": 1616,
      "!!#)": 1617,
      ">-)!$-*!$A*$A*A>-)!$-*!$A*$A*A": 1618,
      "4!#)!5": 1619,
      "!&)-*\"#": 1620,
      "E#": 1621,
      "\"&\"\"$3*\"\"": 1622,
      "\"&!*\"\"#": 1623,
      "\"1\"\"\"$2*\"$2*": 1624,
      "\"$(*+": 1625,
      "(!$)-*,$!!!()!$(*(*": 1626,
      "\"1\"\"\"\"$A*\"1*": 1627,
      "!!(!!1*": 1628,
      "!1)": 1629,
      "\"#\"\"\"$%+&": 1630,
      "+&!": 1631,
      "-!!!-": 1632,
      "!!1*\"\"#": 1633,
      "!$)-*-#": 1634,
      "\"#\"\"\"7#*": 1635,
      "!.$-": 1636,
      "!!($/$)-*$)-*": 1637,
      "(*\"\"#": 1638,
      "\"&+0": 1639,
      "(:": 1640,
      "\"9\"\"+\"\"": 1641,
      "\"#+\"\"\"\"#": 1642,
      "!9!!9*": 1643,
      "(&!!($!$)-*": 1644,
      "!&!!!!&*": 1645,
      "8$!*$-*": 1646,
      "+\"$/": 1647,
      ",#!": 1648,
      "+\"$(!$)-*": 1649,
      "/*)(": 1650,
      "\"\"\"#&": 1651,
      "\"9\"1": 1652,
      ",#&": 1653,
      "!!!($!*!*": 1654,
      "\"&\"#)-": 1655,
      "\"$-*\"$": 1656,
      ".<": 1657,
      "\"#+7": 1658,
      "6&1": 1659,
      "\"#\"\"\"&\"$\"#*-!-&": 1660,
      "4!)!#5": 1661,
      "!+&\"+": 1662,
      "!$)-*(.$!\"&\"\"\"\"\"&*": 1663,
      "\"#\"\"\"\"$!$A*$A*A*\"#": 1664,
      "\"#\"\"\"\"$!": 1665,
      "\"9\"\"\"\"\"9*!!1*": 1666,
      "\"1\"\"\"$!$A*$A*A*\"\"1*": 1667,
      "+#%\"#\"\"\"\"\"#": 1668,
      "+:": 1669,
      "\"&\"\"\"\"$-": 1670,
      "-!\"#\"\"\"\"\"#": 1671,
      "!\"#\"\"$!*\"\"$": 1672,
      "!!!&*": 1673,
      "+$%\"&\"\"\"\"\"&*": 1674,
      "+\"+#": 1675,
      "\"&+\"$%\"1\"\"\"\"\"1*": 1676,
      "!1)(": 1677,
      "\"#+\"$(*": 1678,
      "\"&\"\"$-!*": 1679,
      "\"1\"$2*\"\"": 1680,
      "!.9": 1681,
      "!$-*$": 1682,
      "/$)-*$)-*\"#\"\"\"\"\"#": 1683,
      "+\"#*": 1684,
      "!!&)-*": 1685,
      "(!$)-*\"#\"\"$": 1686,
      "!!2*": 1687,
      "9*\"\"&": 1688,
      "+&\"#": 1689,
      "!!$!*$-*": 1690,
      "!-\"#\"\"$(": 1691,
      "\"&\"\"\"+\"&": 1692,
      "\"&\"\"\"\"\"&\"#*": 1693,
      "!1)!$": 1694,
      "!($!*\"#\"\"\"$": 1695,
      "!!\"1\"\"\"\"\"1": 1696,
      "!$)-*-!!": 1697,
      "\"9\"\"\"$-*\"\"": 1698,
      "\"&\"\"$(1": 1699,
      "\"9\"\"\"$%": 1700,
      ")!#4": 1701,
      "-)!#\"&\"\"\"\"\"&": 1702,
      "!\"#0": 1703,
      "\"\"+#": 1704,
      "!1$": 1705,
      "(,$": 1706,
      "!!&*\"\"\"#": 1707,
      "(!$)-*4!)!4": 1708,
      "!&!!1": 1709,
      "\"1\"\"\"$A*": 1710,
      "\"9\"\"\"7": 1711,
      "\"9\"\":": 1712,
      "\"1\"\"\"\"9\"\"\"\"": 1713,
      "!-!": 1714,
      "!!!!!!(": 1715,
      "\"&\"\"\"$-*\"\"&": 1716,
      ")Z": 1717,
      "!*\"#": 1718,
      "!!89": 1719,
      "9!*": 1720,
      "\"#\"\"\"\"&\"\"\"\"\"#&*": 1721,
      "\"&\"+\"\"": 1722,
      "+\"#(": 1723,
      "!-\"#\"\"\"\"\"#%": 1724,
      "!!#)(": 1725,
      ",$!*.$-*": 1726,
      "-)!$-": 1727,
      "Y$!*": 1728,
      "01*": 1729,
      "!,9": 1730,
      "8$!*": 1731,
      "!!(!!#": 1732,
      "\"#+\"\"$%": 1733,
      "\"&\"\"\"\"\"&*!#": 1734,
      "\"&\"\"\"\"\"&\"#)-": 1735,
      "++#&": 1736,
      "\"&\"\"\"$!$A*$A*A*\"\"&*": 1737,
      "*(#!!!$": 1738,
      "!!.$-*": 1739,
      "\"#\"\"\"$2*\"$2*\"#": 1740,
      ",$!*!,$": 1741,
      "!!6:": 1742,
      "!$)-*(.#": 1743,
      "!!:": 1744,
      "!$)-*!&": 1745,
      "\"$2*\"1*": 1746,
      "!$)-*(!#": 1747,
      "\"9\"\"\":\"$": 1748,
      "\"1\"\"\"\"\"1*\"\"&*": 1749,
      "\"#\"\"\"$2*": 1750,
      "(#!!-!!#": 1751,
      "\"&\"+$": 1752,
      "!$!$)-*-*": 1753,
      "\"$)-*+$!": 1754,
      "!!$-": 1755,
      "!!!($!!!*": 1756,
      "\"&\"7": 1757,
      "+$%\"1\"\"\"\"\"1*": 1758,
      "!\"#\"\"\"\"\"#%": 1759,
      "\"#\"\"\"\"\"#2*": 1760,
      "+#!": 1761,
      "!$!*$!*.:!!691!*": 1762,
      "6:": 1763,
      "!$)-*(&!!!$": 1764,
      "+\"+&": 1765,
      "-)!$(4()!4": 1766,
      "\"1\"$-*": 1767,
      "6#$-*": 1768,
      "\"\"$2*": 1769,
      "!$!*$!*-*": 1770,
      "!!9!!$!!$!": 1771,
      ".$(!$)-*": 1772,
      "!!8&#!": 1773,
      "\"#+\"$%\"&\"\"\"\"\"&*": 1774,
      "\"&\"\"\"\"\"&#*": 1775,
      "9!!-!!9*": 1776,
      "!$)-*B*": 1777,
      "!!,#-!$)-*": 1778,
      "\"1\"\"'": 1779,
      "!-#": 1780,
      "!-&": 1781,
      "61$!*": 1782,
      "-!\"&\"\"\"\"\"&*": 1783,
      "!!!!!!!!$)-*": 1784,
      "!&$!*!": 1785,
      "6&$-*": 1786,
      "2\"#\"\"\"$": 1787,
      ",#!!,&.1": 1788,
      "\"&'#": 1789,
      ")E)Z": 1790,
      "!!+#\"$)-*": 1791,
      "!.$(*": 1792,
      "!$!*$!*!*\"\"#": 1793,
      "81$": 1794,
      "!$!-*": 1795,
      "\"1+\"\"\"\"1": 1796,
      "\"1\"\"$2*\"\"\"1": 1797,
      "\"&)-*\"#": 1798,
      "\"&\"$\"#": 1799,
      "4!)!$4": 1800,
      "!($!!": 1801,
      "-!,1-.$": 1802,
      "2>2": 1803,
      "!!$)-*($!*": 1804,
      "3*\"#": 1805,
      "\"&\"\"\"$2*\"$2*\"&*": 1806,
      "(\"#\"\"": 1807,
      "\"\"$!": 1808,
      "\"&\"\"#-": 1809,
      "!&*!!#": 1810,
      "\"\"&\"$": 1811,
      "\"#\"+$%": 1812,
      "\"#\"\"\"$/$)-*$)-*(": 1813,
      "\"9*\"\"": 1814,
      "2*\"#*": 1815,
      "\"#\"\"$2*\"\"\"#": 1816,
      "!$)-*($!*!*": 1817,
      "\"$+&*": 1818,
      "0&*\"\"#": 1819,
      "\"1\"\"\"$(!$)-*": 1820,
      ".1-": 1821,
      "7&*\"#": 1822,
      "!!81$!*": 1823,
      "(!$)-*,#": 1824,
      "\"&+\"\"\"$": 1825,
      "\":9*": 1826,
      "(!#)(": 1827,
      "\"$%\"&\"\"\"$": 1828,
      "+1\"\"$": 1829,
      "!$!*)!$": 1830,
      "4()!#5": 1831,
      "\"$)-*\"&\"#": 1832,
      "(!$)-*.#!!!(#!$)-*,$": 1833,
      "!\"#\"\"\"$/$)-*$)-*(&": 1834,
      "\"C": 1835,
      "\"#\"\"\"'#*": 1836,
      "\"#\"\"\"$-*\"$-*": 1837,
      "\"&\"\"$A*": 1838,
      "\"9+\"\"": 1839,
      "!!($!!*!$)-*": 1840,
      "!4!$": 1841,
      "!$)-*(/$)-*$)-*": 1842,
      "!!($!*!!1*": 1843,
      "\"#\"\"&\"\"$": 1844,
      "!&*+#": 1845,
      "6&$": 1846,
      "!$)-*(,$!*": 1847,
      "\"+&*\"\"#": 1848,
      "\"\"\"\"9": 1849,
      "!$A*$A*!$A*$A*": 1850,
      "\"1\"\"\"\"$!$A*$A*A*\"1*": 1851,
      "\"1\"'": 1852,
      "-)!$!-!$)-*": 1853,
      "!!9!!$!!$!9*!&*": 1854,
      "!!(&!$)-*": 1855,
      "\"&\"\"\"\"$-!*": 1856,
      "*\"\"+#": 1857,
      ")/": 1858,
      "\"\"#2": 1859,
      "\"&\"$2*\"\"\"\"&": 1860,
      "\"9\"\"$2*\"\"": 1861,
      "\"1A*": 1862,
      "!!$A*$A*A*": 1863,
      "!-\"&\"\"\"$": 1864,
      "\"1+\"$(": 1865,
      ")!$!*(": 1866,
      "!!(#!!!$": 1867,
      "'&*\"#": 1868,
      "\"#\"\"\"$A*": 1869,
      "\"1\"\"\"\"$!*": 1870,
      "-)!$!(#": 1871,
      "!#)!$-*": 1872,
      "\"1+&*\"\"#": 1873,
      "!\"#'": 1874,
      "\"1\"$A*\"\"\"\"1": 1875,
      "!!($!!$)-*(": 1876,
      "\"&1*!!#": 1877,
      "!!#!!#*": 1878,
      "!$(!$)-*": 1879,
      "1*\"\"$": 1880,
      "\"#\"\"$%\"&\"\"\"\"\"&*": 1881,
      "!&$!*!*": 1882,
      "\"$-!": 1883,
      "\"$(*+\"+": 1884,
      "-!-&*": 1885,
      "-\"#\"\"\"\"\"#": 1886,
      "++\"#": 1887,
      "!!(!$)-*(": 1888,
      "\"$(!": 1889,
      "!$A*$A*A*\"\"&": 1890,
      "!!!$!!*": 1891,
      "\"#\"\"\"$%\"&\"\"\"$": 1892,
      "!\"#\"\"$-*": 1893,
      "\"9\"1*": 1894,
      "\"\"\"#-": 1895,
      "!!#!!!-": 1896,
      "\"1\"&*\"\"#": 1897,
      "\"1\"\"\"\"\"1*!!&*\"\"#": 1898,
      "!$\"#\"\"\"\"\"#*": 1899,
      "++\"#%": 1900,
      "!$)-*(-*": 1901,
      "\"$E$)-*B*\"#": 1902,
      "\"1\"\"7": 1903,
      "+&\"\"$%": 1904,
      "\"#\"\"\"\"\"#A": 1905,
      "\"&\"\"+\"$(": 1906,
      "!-!$)-*,$": 1907,
      "\"1\"\"\"$2*\"$2*\"1*": 1908,
      "\"#\"\"\"$3*\"\"#*": 1909,
      "!-F$)-*$-*-": 1910,
      "!\"#+\"$(": 1911,
      "\"1\"\"\"\"$%": 1912,
      "!-\"#\"\"\"\"\"#(#!!($": 1913,
      "++#*": 1914,
      "!&#": 1915,
      "\"#\"\"\"$-*": 1916,
      "\"#\"\"\"&\"$\"#*-!!-": 1917,
      "!#$!*!": 1918,
      "!\"#\"$!*": 1919,
      "\"&\"++1": 1920,
      "\"&1*\"#": 1921,
      "!-\"#\"\"\"&0": 1922,
      "$!9": 1923,
      ":*\"\"9*": 1924,
      "A\"#\"\"\"$": 1925,
      "\"#\"\"\"$A*\"\"#A": 1926,
      "+\"1\"$": 1927,
      "!!#$!*!": 1928,
      "\"$)/*": 1929,
      "\"#\"\"$)-*": 1930,
      "!!&!!!!!&*": 1931,
      "!!)!$!*!*": 1932,
      "\"#\"\"$2*": 1933,
      "+&\"$)-*": 1934,
      "!\"#\"$!$)-*(": 1935,
      "!\"#\"\"\"7#": 1936,
      "\"9\"\"\"\"$2*": 1937,
      ",$!": 1938,
      "=$!*": 1939,
      "\"#\"\"\"\"\"#*(#": 1940,
      "!!!(9": 1941,
      "!)!$!*.#": 1942,
      "!\"#++$!*": 1943,
      "!!$!*!": 1944,
      "(!$)-*.$!": 1945,
      "+\"+\"$(": 1946,
      "\"1\"\"\"$E$)-*B": 1947,
      "(!$)-*,$!$!*!*": 1948,
      "!!$!*)!!!": 1949,
      "!$)-*-*\"#": 1950,
      "!!!($!*": 1951,
      "+\"1\"\"\"\"\"1": 1952,
      "\"$A*\"&*": 1953,
      "\"#\"\"\"$2*\"\"#2": 1954,
      "(\"#+\"$(": 1955,
      "\"\"\"\"\"9": 1956,
      "\":0": 1957,
      "!!$)-*(!": 1958,
      "!!,$!*.#": 1959,
      "!!1*\"\"&*": 1960,
      "!$!": 1961,
      "\"&\"$(": 1962,
      "(#!!($!$)-*": 1963,
      "1*\"\"\"&": 1964,
      "\"1\"\"$-!*": 1965,
      "!\"#\"\"\"\"$!*\"#": 1966,
      ",$!*.$-.&-": 1967,
      "!!$!*$!*!*": 1968,
      "!!!!!!#": 1969,
      ",$!*!,$($!*!*": 1970,
      "\"0#": 1971,
      "4!)!1": 1972,
      "!!!!!!!": 1973,
      "3*\"\"$": 1974,
      "!1!!!!1*": 1975,
      "\"&\"\"\"$%\"1\"\"\"\"\"1*\"\"&*": 1976,
      "1*\"\"\"&#": 1977,
      "!!6&$": 1978,
      "\"#\"\"\"&7": 1979,
      "\"1+7": 1980,
      "\"#\"+\"\"$": 1981,
      "!//!.$": 1982,
      "!!#!!($": 1983,
      ".#-*": 1984,
      "\"#\"\"\"\"$E$)-*B*\"#": 1985,
      "\"#\"\"\"$-*\"\"#*": 1986,
      "(!$)-*(#": 1987,
      ",<": 1988,
      "-,1": 1989,
      "\"1\"\"\"9": 1990,
      "7\"$)-*": 1991,
      "!\"#\"\"\"+\"#": 1992,
      "!($!*!": 1993,
      "\"&+\"\"\"+": 1994,
      "4()!$4": 1995,
      ",#-*": 1996,
      "++$!*": 1997,
      "!$!*!*\"#": 1998,
      "!!!!&*\"\"#": 1999,
      "!-\"#\"\"\"\"&\"#": 2000,
      "\"&\"\"\"$E$)-*B*\"\"&": 2001,
      "-&*\"\"#": 2002,
      "\"&\"\"\"$3*\"\"&": 2003,
      "(!!!!": 2004,
      "!\"&\"$": 2005,
      "\"&#*": 2006,
      "\"&\"\"\"+\"&*\"\"#": 2007,
      "\"\"\"&\"#": 2008,
      "!\"#\"\"\"$-*\"\"#": 2009,
      "\"&\"#\"\"": 2010,
      "\"$!(": 2011,
      "(!$)-*!&": 2012,
      "8&$-*": 2013,
      "-!#)-": 2014,
      "\"1\"\"$-!*\"$-!*\"$-!*": 2015,
      "()!&": 2016,
      "-)F": 2017,
      "\"1\"0\"9\"\"\"\"\"19*": 2018,
      ">-": 2019,
      "\"&\"\"\"$2*\"\"&*\"#": 2020,
      "4!$)(4-*": 2021,
      "(!$)-*,$.$!*-*": 2022,
      "\"\":": 2023,
      "!:*": 2024,
      "-9*": 2025,
      ".$-*,#-": 2026,
      "+\"1&*": 2027,
      "$\"#\"\"\"\"\"#*": 2028,
      "\"#\"$(": 2029,
      "+\"#!": 2030,
      "!$)-*(.$!!!!(*!$)-*(.$!!!!(*": 2031,
      "-F$)-*$-*": 2032,
      "\\$-*": 2033,
      "+$%\"&\"\"\"\"\"&*+#": 2034,
      "+\"&*\"\"#": 2035,
      "!$)-*(.$!!!(!$)(*(*!$)-*(.$!!!(!$)(*(*": 2036,
      "-#*": 2037,
      "!-\"#\"\"\"$-": 2038,
      ".$!\"#\"\"\"\"\"#*": 2039,
      "$!*!!,$-*": 2040,
      "4!$!D(*": 2041,
      "!!81": 2042,
      "!)!!$)-*(": 2043,
      "\"1\"\"\"$E$)-*B*\"\"1*": 2044,
      "\"$!$(*)-*": 2045,
      "\"&\"\"\"1\"$\"&*-!!-": 2046,
      "!!9*\"\"": 2047,
      "!(#!!": 2048,
      "2*\"\"1": 2049,
      "!-\"#\"\"\"$!(": 2050,
      "!-\"#\"\"\"$!(!$)-*": 2051,
      "/!$)/*(": 2052,
      "\"&\"\"\"$A*\"\"&A*": 2053,
      "()": 2054,
      "-!-1": 2055,
      "-)!$!/": 2056,
      "*\"\"\"#%": 2057,
      "\"&\"\"$2*": 2058,
      "\"9\"\"\"\":": 2059,
      "\"&\"\"\"\"1\"&": 2060,
      "\"&\"\"\"\"$3*": 2061,
      "!$)-*(9": 2062,
      "-*,$-*": 2063,
      "-!,&": 2064,
      "\"#\"+&": 2065,
      "\"9\"\"\"\"\"9*\"\"": 2066,
      "\"1\"\"\"$-*\"\"1": 2067,
      "\"9\"\"\"79*": 2068,
      "!!(!!&*": 2069,
      "\"&\"\"$!$A*$A*A*\"\"": 2070,
      "\"'&*": 2071,
      "!#&!!1!!$!!$!1*!#*": 2072,
      "\"1\"\"\"$!D(": 2073,
      ".&!": 2074,
      "\"#\"\"+\"\"#*": 2075,
      "\"&++0": 2076,
      "7\"#&": 2077,
      ")!$(": 2078,
      "\"#+++": 2079,
      "\"&\"\"\"$-!*\"$-!*": 2080,
      "\"1\"\"\"$2*": 2081,
      "!//!,$": 2082,
      "!$)-*-!!$)-*(": 2083,
      "\"1*\"\"&*": 2084,
      "\"&\"\"+\"\"&": 2085,
      "!$-": 2086,
      "!!&!!!-": 2087,
